IDEA StatiCa Open Model
RebarHookBase.AxisY Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Gets or sets the position (direction) of the hook in 3D. It representa a Local Coordinate System. Hook lie in X-Y Plane. AxisX is defined by first/last segment of the rebar. AxisX and AxisY creates a plane where the hook lies.
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public Vector3D AxisY { get; set; }
Public Property AxisY As Vector3D
	Get
	Set
public:
property Vector3D^ AxisY {
	Vector3D^ get ();
	void set (Vector3D^ value);
}
Property Value
Type: Vector3D
See Also
Reference
RebarHookBase Class
IdeaRS.OpenModel.Model Namespace